# Aula 2 - Data Science

In [1]:
import pandas as pd
url = "https://drive.google.com/uc?id=1Jgto7psHaMRTAVzcFt7D6SgJiHMB7uGT"
escolas = pd.read_csv(url)

print(escolas)

    ID_Escola Nome_Escola Tipo_Escola  Numero_Alunos  Orcamento_Anual
0           0    Escola A     Publica           2917          1910635
1           1    Escola B     Publica           2949          1884411
2           2    Escola C  Particular           1761          1056600
3           3    Escola D     Publica           4635          3022020
4           4    Escola E  Particular           1468           917500
5           5    Escola F  Particular           2283          1319574
6           6    Escola G  Particular           1858          1081356
7           7    Escola H     Publica           4976          3124928
8           8    Escola I  Particular            427           248087
9           9    Escola J  Particular            962           585858
10         10    Escola K  Particular           1800          1049400
11         11    Escola L     Publica           3999          2547363
12         12    Escola M     Publica           4761          3094650
13         13    Escola N     Publica           2739          1763916
14         14    Escola O  Particular           1635          1043130

In [2]:
escolas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID_Escola        15 non-null     int64
 1   Nome_Escola      15 non-null     object
 2   Tipo_Escola      15 non-null     object
 3   Numero_Alunos    15 non-null     int64
 4   Orcamento_Anual  15 non-null     int64
dtypes: int64(3), object(2)
memory usage: 732.0+ bytes

In [3]:
escolas.duplicated().sum()

np.int64(0)

In [4]:
escolas.isna().sum()

ID_Escola          0
Nome_Escola        0
Tipo_Escola        0
Numero_Alunos      0
Orcamento_Anual    0
dtype: int64

In [5]:
escolas.isnull().sum()

ID_Escola          0
Nome_Escola        0
Tipo_Escola        0
Numero_Alunos      0
Orcamento_Anual    0
dtype: int64

In [6]:
type(escolas)

pandas.core.frame.DataFrame

In [7]:
#Ajustar a configuração global parea evitar notação científica
pd.set_option('display.float_format','{:.2f}'.format)

escolas.describe()

       ID_Escola  Numero_Alunos  Orcamento_Anual
count      15.00          15.00            15.00
mean        7.00        2611.33       1643295.20
std         4.47        1420.92        934776.29
min         0.00         427.00        248087.00
25%         3.50        1698.00       1046265.00
50%         7.00        2283.00       1319574.00
75%        10.50        3474.00       2228999.00
max        14.00        4976.00       3124928.00

In [8]:
quantitativas = ['Numero_Alunos', 'Orcamento_Anual']

escolas[quantitativas].describe()

       Numero_Alunos  Orcamento_Anual
count          15.00            15.00
mean         2611.33       1643295.20
std          1420.92        934776.29
min           427.00        248087.00
25%          1698.00       1046265.00
50%          2283.00       1319574.00
75%          3474.00       2228999.00
max          4976.00       3124928.00

In [9]:
qualitativas = ['Nome_Escola', 'Tipo_Escola']

escolas[qualitativas].describe()

       Nome_Escola Tipo_Escola
count           15          15
unique          15           2
top       Escola A  Particular
freq             1           8

In [10]:
#Qual é o orçamento total de todas as escolas?#
orc_total = escolas["Orcamento_Anual"].sum()

print(orc_total)

24649428

In [11]:
#Qual escola tem o maior e o menor gasto per capita (gasto por aluno)?#
escolas["Gasto_Por_Aluno"] = escolas["Orcamento_Anual"] / escolas["Numero_Alunos"]
esc_maior_gasto = escolas.loc[escolas["Gasto_Por_Aluno"].idxmax()]
esc_menor_gasto = escolas.loc[escolas["Gasto_Por_Aluno"].idxmin()]

print(esc_maior_gasto)

print(esc_menor_gasto)

ID_Escola                 0
Nome_Escola        Escola A
Tipo_Escola         Publica
Numero_Alunos          2917
Orcamento_Anual     1910635
Gasto_Por_Aluno      655.00
Name: 0, dtype: object
ID_Escola                   5
Nome_Escola          Escola F
Tipo_Escola        Particular
Numero_Alunos            2283
Orcamento_Anual       1319574
Gasto_Por_Aluno        578.00
Name: 5, dtype: object

In [12]:
#Qual é a média do número de alunos por tipo de escola (Pública vs.Particular)?#
med_alunos = escolas.groupby("Tipo_Escola")["Numero_Alunos"].mean()

print(med_alunos)

Tipo_Escola
Particular   1524.25
Publica      3853.71
Name: Numero_Alunos, dtype: float64

In [13]:
#Quantas escolas têm um orçamento anual acima de 1,5 milhão?#
esc_ricas = (escolas["Orcamento_Anual"] > 1_500_000).sum()

print(esc_ricas)

7

In [14]:
import pandas as pd
url = "https://drive.google.com/uc?id=15aOJIGAyLMSY1gecjiCgu2ko_riIcKQy"
alunos = pd.read_csv(url)

print(alunos)

       ID_Estudante       Nome_Estudante Genero  Serie Nome_Escola  \
0                 0        Kevin Bradley      M      6    Escola A
1                 1           Paul Smith      M      9    Escola A
2                 2       John Rodriguez      M      9    Escola A
3                 3         Oliver Scott      M      9    Escola A
4                 4          William Ray      F      6    Escola A
...             ...                  ...    ...    ...         ...
39155         39155          John Brooks      M      7    Escola O
39156         39156  Stephanie Contreras      F      8    Escola O
39157         39157     Kristen Gonzalez      F      6    Escola O
39158         39158        Kari Holloway      F      7    Escola O
39159         39159     Kimberly Cabrera      F      8    Escola O

       Nota_Redacao  Nota_Matematica
0                66               79
1                94               61
2                90               60
3                67               58
4                97               84
...             ...              ...
39155            92               98
39156            79               95
39157            79               94
39158            87               90
39159            85               72

[39160 rows x 7 columns]

In [15]:
#União das tabelas em python

import pandas as pd

url_alunos = "https://drive.google.com/uc?id=15aOJIGAyLMSY1gecjiCgu2ko_riIcKQy"
url_escolas = "https://drive.google.com/uc?id=1Jgto7psHaMRTAVzcFt7D6SgJiHMB7uGT"

alunos = pd.read_csv(url_alunos)
escolas = pd.read_csv(url_escolas)

dados_completos = alunos.merge(escolas, on="Nome_Escola", how="inner")

print(dados_completos.head(10))

   ID_Estudante   Nome_Estudante Genero  Serie Nome_Escola  Nota_Redacao  \
0             0    Kevin Bradley      M      6    Escola A            66
1             1       Paul Smith      M      9    Escola A            94
2             2   John Rodriguez      M      9    Escola A            90
3             3     Oliver Scott      M      9    Escola A            67
4             4      William Ray      F      6    Escola A            97
5             5    James Miranda      M      6    Escola A            94
6             6  Benjamin Carter      F      8    Escola A            82
7             7      Mason Baker      F      9    Escola A            96
8             8       Ethan Roth      M      7    Escola A            95
9             9     Jacob Greene      M      7    Escola A            96

   Nota_Matematica  ID_Escola Tipo_Escola  Numero_Alunos  Orcamento_Anual
0               79          0     Publica           2917          1910635
1               61          0     Publica           2917          1910635
2               60          0     Publica           2917          1910635
3               58          0     Publica           2917          1910635
4               84          0     Publica           2917          1910635
5               94          0     Publica           2917          1910635
6               80          0     Publica           2917          1910635
7               69          0     Publica           2917          1910635
8               87          0     Publica           2917          1910635
9               84          0     Publica           2917          1910635

In [16]:
#Características que podemos obter com a junção: Distribuição de alunos por tipo de escola

distribuicao = dados_completos["Tipo_Escola"].value_counts()

print(distribuicao)

Tipo_Escola
Publica       26976
Particular    12184
Name: count, dtype: int64

In [17]:
#Características que podemos obter com a junção: Orçamento por aluno

dados_completos["Orcamento_Por_Aluno"] = dados_completos["Orcamento_Anual"] / dados_completos["Numero_Alunos"]
orcamento = dados_completos.groupby("Tipo_Escola")["Orcamento_Por_Aluno"].mean()

print(orcamento)

Tipo_Escola
Particular   598.75
Publica      643.09
Name: Orcamento_Por_Aluno, dtype: float64